app/views/courses/evaluations_grades.html.erb

SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."course_id" = ? ORDER BY "evaluations"."date" ASC  [["course_id", 27]]
---
    <th>Alumno</th>
    <% @course.evaluations.order(:date).each do |e|%>

SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ? ORDER BY "students"."last_name" ASC  [["course_id", 27]]
---
  <tbody>
    <% @course.students.order(:last_name).each do |s|%>