app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" ORDER BY "courses"."year" ASC
---
  def index
    @courses = Course.order(:year)

SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ?  [["course_id", 27]]
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."course_id" = ?  [["course_id", 27]]
SELECT  "student_grades".* FROM "student_grades" WHERE "student_grades"."evaluation_id" = 25 AND "student_grades"."student_id" = 140 LIMIT ?  [["LIMIT", 1]]
---
  def evaluations_grades
    @grades = {}
    @course.students.collect do |s|
        @grades[s.id] = []
        @course.evaluations.each do |e|
          evaluation_grade = StudentGrade.find_or_initialize_by(evaluation: e,student: s)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
SELECT  "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
---
    def set_course
      @course = Course.find(params[:id])
      @students_grades = StudentGrade.where(evaluation: @course.evaluations)