app/controllers/evaluations_controller.rb

SELECT  "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
---
    def set_evaluation
      @evaluation = Evaluation.find(params[:id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
---
    def set_evaluations
      @course = Course.find(params[:course_id])