app/controllers/students_grades_controller.rb

  def new
    evaluation = Evaluation.find(params[:id])
---
SELECT  "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]

  def edit
    @student_grade = StudentGrade.find_or_initialize_by(evaluation_id: params[:id], student_id: params[:student_grade][:student_id])
---
SELECT  "student_grades".* FROM "student_grades" WHERE "student_grades"."evaluation_id" = ? AND "student_grades"."student_id" = ? LIMIT ?  [["evaluation_id", 25], ["student_id", 144], ["LIMIT", 1]]

  def set_student_grade
    StudentGrade.find(params[:id])
---
SELECT  "student_grades".* FROM "student_grades" WHERE "student_grades"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]