app/controllers/students_grades_controller.rb

SELECT  "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
---
  def load_grade
    evaluation = Evaluation.find(params[:id])