app/controllers/students_controller.rb

SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ? ORDER BY "students"."last_name" ASC  [["course_id", 27]]
---
  def index
    @students = @course.students.order(:last_name)

INSERT INTO "students" ("first_name", "last_name", "dni", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Juan"], ["last_name", "Gonzalez"], ["dni", 32145787], ["email", "jaungonza@gmail.com"], ["created_at", "2018-02-01 16:52:54.922292"], ["updated_at", "2018-02-01 16:52:54.922292"]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def create
    @student = Student.new(student_params)
    @student.courses << Course.find(params[:course_id])

SELECT  "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ? AND "students"."id" = ? LIMIT ?  [["course_id", 28], ["id", 151], ["LIMIT", 1]]
---
    def set_student
      @student = @course.students.find(params[:id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
---
    def set_students
      @course = Course.find(params[:course_id])